wegam/STM32F1xWorkSpace/Driver/Protocol/HC_PHY - 20180907.C
/*******************************************************************************
* 函数名			:	SetDataRS485
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult MBLayerDataProcess(const unsigned char *buffer,const unsigned short length,const unsigned char UDflag)
{
	HCResult	res	=	RES_OK;
	RS232FrameDef	*RS232Frame	=	NULL;
  RS485FrameDef *RS485Frame	=	NULL;
	unsigned char	*TargetDataAdd	=	NULL;
	unsigned char	*SourceDataAdd	=	NULL;
	unsigned char TargetAddr		=	0;			//目标地址
	res	=	CheckDataFarm(buffer,length,UDflag);
  //======================================RS232转RS485
	if(RES_FARME232	==	res)		//232格式数据
	{
		if(7	==	length)			//上位机应答数据长度
		{
			TransU.Length	=	0;
		}
		else			//转换为RS485格式数据
		{			
			RS232Frame	=	(RS232FrameDef*)memchr(buffer,RS232Head1,length);		//查找RS232Head1头标识符
			TargetAddr	=	RS232Frame->Addr.CabinetAddr;													//获取单元板地址			
			RS485Frame	=	(RS485FrameDef*)DataNode[TargetAddr].data;						//数据存储起始地址
      
      if(3>RS232Frame->Head.DataLength)   //无数据，表示为上位机应答
      {
        TransU.Length = 0;      //清除上传标志
        return RES_ACKMSG;      //退出--返回此标志为应答标志
      }
			RS485Frame->HeadCode	=	RS485Head1;								//头标识
			RS485Frame->TargetAdd	=	TargetAddr;								//目标地址
			RS485Frame->SourceAdd	=	0x00;											//源地址
			RS485Frame->Serial		=	RS232Frame->Head.Serial;	//流水号
			RS485Frame->Cmd				=	RS232Frame->Head.Cmd;			//命令号
			RS485Frame->UserCode	=	RS232Frame->Head.UserCode;//用户码
      RS485Frame->DataLength=	RS232Frame->Head.DataLength-4;	//数据长度，去掉地址和状态码所占长度,RS485协议数据长度不包含地址和状态码长度
      
      memcpy(&RS485Frame->Addr.CabinetAddr,&RS232Frame->Addr,3); //复制地址
//			memcpy(&DataNode[TargetAddr].data[11],&RS232Frame->Addr+3,RS485Frame->DataLength);//复制数据，不包含地址信息
//			memcpy(&RS485Frame->data,&RS232Frame->Addr+3,RS485Frame->DataLength); //复制数据，不包含地址信息
			SourceDataAdd	=	(unsigned char*)RS232Frame;
			SourceDataAdd	=	(unsigned char*)&SourceDataAdd[11];
			TargetDataAdd	=	&(DataNode[TargetAddr].data[11]);

			memcpy(TargetDataAdd,SourceDataAdd,RS485Frame->DataLength);

      DataNode[TargetAddr].data[RS485Frame->DataLength+11] = BCC8(&RS485Frame->HeadCode,RS485Frame->DataLength+11);
      DataNode[TargetAddr].data[RS485Frame->DataLength+12] = RS485end1;
      DataNode[TargetAddr].FarmeInfo.Length = RS485Frame->DataLength+13;    //整个帧长度
      DataNode[TargetAddr].FarmeInfo.UD     = 1;    //此数据需要转发到下一级
      DataNode[TargetAddr].FarmeInfo.Flag   = 1;    //有数据标识
      
			res	=	RES_OK;
		}
	}
  //======================================RS485转RS232
  else if(RES_FARME485	==	res)		//232格式数据
  {
    RS485Frame  = (RS485FrameDef*)memchr(buffer,RS485Head1,length);		//查找RS485Head1头标识符
    TargetAddr  = RS485Frame->SourceAdd;                              //上传数据的单元板地址
    RS232Frame  = (RS232FrameDef*)DataNode[TargetAddr].data;
    
    if(0  ==  RS485Frame->DataLength)   //无数据，表示为单元板应答
    {
      TransD.Length = 0;      //清除下发标志
      return RES_ACKMSG;      //退出--返回此标志为应答标志
    }
    
    RS232Frame->Head.Head1      = RS232Head1;
    RS232Frame->Head.Head2      = RS232Head2;
    RS232Frame->Head.Serial     = SerialU++;      //往上传流水号
    RS232Frame->Head.Cmd        = RS485Frame->Cmd;
    //-->此为校验码    
    RS232Frame->Head.UserCode   	= RS485Frame->UserCode;    
    RS232Frame->Head.DataLength 	= RS485Frame->DataLength+3;
    RS232Frame->Addr.CabinetAddr	= RS485Frame->Addr.CabinetAddr;
    RS232Frame->Addr.LayerAddr  	= RS485Frame->Addr.LayerAddr;
    RS232Frame->Addr.SlotAddr  		= RS485Frame->Addr.SlotAddr;
    RS232Frame->StsCode    				= RS485Frame->StsCode;
		//----------------------------从地址后开始复制数据
		SourceDataAdd	=	(unsigned char*)RS485Frame;
		SourceDataAdd	=	(unsigned char*)&SourceDataAdd[11];
		
		TargetDataAdd	=	(unsigned char*)RS232Frame;
		TargetDataAdd	=(unsigned char*)&TargetDataAdd[11];
		
    memcpy(TargetDataAdd,SourceDataAdd,RS485Frame->DataLength);
		DataNode[TargetAddr].data[10]	=	RS485Frame->StsCode;
    RS232Frame->Head.Bcc8 = BCC8(&RS232Frame->Head.DataLength,RS232Frame->Head.DataLength);
		
    DataNode[TargetAddr].FarmeInfo.Length = RS232Frame->Head.DataLength+sizeof(RS232HeadDef);  //整个帧长度
    DataNode[TargetAddr].FarmeInfo.UD     = 0;    //此数据需要转发到上一级
    DataNode[TargetAddr].FarmeInfo.Flag   = 1;    //有数据标识
		
		res	=	RES_OK;
  }

  return res;
}
/*******************************************************************************
* 函数名			:	RS485ToRS485
* 功能描述		:	RS485转RS485 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult RS485ToRS485(const unsigned char *buffer,const unsigned short length,const unsigned char UDflag)
{
	HCResult	res	=	RES_OK;
  RS485FrameDef *Frame  		= NULL;
	unsigned char TargetAdd		=	0;		//目标地址
	unsigned char LayerAddr		=	0;		//层地址
	unsigned char FrameLength	=	0;	//消息帧总长度，从HeadCode到EndCode的字节数
	
  if(NULL ==  buffer)		//空地址
  {
    return RES_NODATA;
  }
	Frame	    =	(RS485FrameDef*)memchr(buffer,RS485Head1,length);		//查找RS485Head1头标识符
	TargetAdd	=	Frame->TargetAdd;	          //目标地址
	LayerAddr	=	Frame->Addr.LayerAddr;		  //下一级目标地址：如果下级地址为0，表示此消息是本板使用消息，存入RS485Node[0]  
	FrameLength	=	Frame->DataLength+13;     //整个帧长度
  if((TargetAdd ==  HCSYS.SwitchAddr)     //本板消息
    &&(0  ==  UDflag))                    //此消息为上层下发消息
  {
    if(0  ==  Frame->DataLength)  //无数据，表示为网关板应答
    {
      TransU.Length = 0;      //清除上传标志
      return RES_ACKMSG;      //退出--返回此标志为应答标志
    }
    memcpy(&(DataNode[LayerAddr].data[0]),Frame,FrameLength);   //复制数据到本地缓存
    if((0<LayerAddr)&&(0xFF>LayerAddr))   //此消息需要传递到下一层
    {
      ((RS485FrameDef*)(DataNode[LayerAddr].data))->TargetAdd  	= LayerAddr;        //目标地址
      ((RS485FrameDef*)(DataNode[LayerAddr].data))->SourceAdd  	= 0x00; 						//源地址--下发为00
      
      DataNode[LayerAddr].data[Frame->DataLength+11]  = BCC8(DataNode[LayerAddr].data,Frame->DataLength+11);  //重新计数校验
      DataNode[LayerAddr].data[Frame->DataLength+12]  = RS485end1;
      
      DataNode[LayerAddr].FarmeInfo.Length = Frame->DataLength+13;  //整个帧长度
      DataNode[LayerAddr].FarmeInfo.UD     = 1;    //此数据需要转发到下一级
      DataNode[LayerAddr].FarmeInfo.Flag   = 1;    //有数据标识
    }
    res	=	RES_OK;
  }
  else if(1  ==  UDflag)      //底层上传数据：需要添加本层地址后待上传
  {
    if(0  ==  Frame->DataLength)  //无数据，表示为层板应答
    {
      TransD.Length = 0;      //清除下发标志
      return RES_ACKMSG;      //退出--返回此标志为应答标志
    }
    memcpy(&(DataNode[LayerAddr].data[0]),Frame,Frame->DataLength+13);      							//复制数据到本地缓存
    ((RS485FrameDef*)(DataNode[LayerAddr].data))->TargetAdd					= 0;    							//目标地址:上传为0
    ((RS485FrameDef*)(DataNode[LayerAddr].data))->SourceAdd					= HCSYS.SwitchAddr;  	//源地址
    
    ((RS485FrameDef*)(DataNode[LayerAddr].data))->Addr.CabinetAddr  = HCSYS.SwitchAddr;  	//加入本地址--层板地址
    
    DataNode[LayerAddr].data[Frame->DataLength+11]  = BCC8(DataNode[LayerAddr].data,Frame->DataLength+11);  //重新计数校验
    DataNode[LayerAddr].data[Frame->DataLength+12]  = RS485end1;
    DataNode[LayerAddr].FarmeInfo.Length            = Frame->DataLength+13;  //整个帧长度
    DataNode[LayerAddr].FarmeInfo.UD     = 0;    //此数据需要转发到上一级
    DataNode[LayerAddr].FarmeInfo.Flag   = 1;    //有数据标识
    res	=	RES_OK;
  }
  else
  {
    res	= RES_UNKNOW;
  }
  return res;
}
/*******************************************************************************
* 函数名			:	SetDataRS485
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult CALayerDataProcess(const unsigned char *buffer,const unsigned short length,const unsigned char UDflag)
{
	HCResult	res	=	RES_OK;
  RS485FrameDef *Frame  		= NULL;
	unsigned char TargetAdd		=	0;		//目标地址
	unsigned char LayerAddr		=	0;		//层地址
	unsigned char FrameLength	=	0;	//消息帧总长度，从HeadCode到EndCode的字节数
	
  if(NULL ==  buffer)		//空地址
  {
    return RES_NODATA;
  }
	Frame	    =	(RS485FrameDef*)memchr(buffer,RS485Head1,length);		//查找RS485Head1头标识符
	TargetAdd	=	Frame->TargetAdd;	          //目标地址
	LayerAddr	=	Frame->Addr.LayerAddr;		  //下一级目标地址：如果下级地址为0，表示此消息是本板使用消息，存入RS485Node[0]  
	FrameLength	=	Frame->DataLength+13;     //整个帧长度
  if((TargetAdd ==  HCSYS.SwitchAddr)     //本板消息
    &&(0  ==  UDflag))                    //此消息为上层下发消息
  {
    if(0  ==  Frame->DataLength)  //无数据，表示为网关板应答
    {
      TransU.Length = 0;      //清除上传标志
      return RES_ACKMSG;      //退出--返回此标志为应答标志
    }
    memcpy(&(DataNode[LayerAddr].data[0]),Frame,FrameLength);   //复制数据到本地缓存
    if((0<LayerAddr)&&(0xFF>LayerAddr))   //此消息需要传递到下一层
    {
      ((RS485FrameDef*)(DataNode[LayerAddr].data))->TargetAdd  	= LayerAddr;        //目标地址
      ((RS485FrameDef*)(DataNode[LayerAddr].data))->SourceAdd  	= 0x00; 						//源地址--下发为00
      
      DataNode[LayerAddr].data[Frame->DataLength+11]  = BCC8(DataNode[LayerAddr].data,Frame->DataLength+11);  //重新计数校验
      DataNode[LayerAddr].data[Frame->DataLength+12]  = RS485end1;
      
      DataNode[LayerAddr].FarmeInfo.Length = Frame->DataLength+13;  //整个帧长度
      DataNode[LayerAddr].FarmeInfo.UD     = 1;    //此数据需要转发到下一级
      DataNode[LayerAddr].FarmeInfo.Flag   = 1;    //有数据标识
    }
    res	=	RES_OK;
  }
  else if(1  ==  UDflag)      //底层上传数据：需要添加本层地址后待上传
  {
    if(0  ==  Frame->DataLength)  //无数据，表示为层板应答
    {
      TransD.Length = 0;      //清除下发标志
      return RES_ACKMSG;      //退出--返回此标志为应答标志
    }
    memcpy(&(DataNode[LayerAddr].data[0]),Frame,Frame->DataLength+13);      							//复制数据到本地缓存
    ((RS485FrameDef*)(DataNode[LayerAddr].data))->TargetAdd					= 0;    							//目标地址:上传为0
    ((RS485FrameDef*)(DataNode[LayerAddr].data))->SourceAdd					= HCSYS.SwitchAddr;  	//源地址
    
    ((RS485FrameDef*)(DataNode[LayerAddr].data))->Addr.CabinetAddr  = HCSYS.SwitchAddr;  	//加入本地址--层板地址
    
    DataNode[LayerAddr].data[Frame->DataLength+11]  = BCC8(DataNode[LayerAddr].data,Frame->DataLength+11);  //重新计数校验
    DataNode[LayerAddr].data[Frame->DataLength+12]  = RS485end1;
    DataNode[LayerAddr].FarmeInfo.Length            = Frame->DataLength+13;  //整个帧长度
    DataNode[LayerAddr].FarmeInfo.UD     = 0;    //此数据需要转发到上一级
    DataNode[LayerAddr].FarmeInfo.Flag   = 1;    //有数据标识
    res	=	RES_OK;
  }
  else
  {
    res	= RES_UNKNOW;
  }
  return res;
}
/*******************************************************************************
* 函数名			:	SetDataRS485
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult LALayerDataProcess(const unsigned char *buffer,const unsigned short length,const unsigned char UDflag)
{
	HCResult	res	=	RES_OK;
  RS485FrameDef *Frame  		= NULL;
	unsigned char TargetAdd		=	0;		//目标地址
	unsigned char LayerAddr		=	0;		//层地址
	unsigned char FrameLength	=	0;	//消息帧总长度，从HeadCode到EndCode的字节数
	
  if(NULL ==  buffer)		//空地址
  {
    return RES_NODATA;
  }
	Frame	    =	(RS485FrameDef*)memchr(buffer,RS485Head1,length);		//查找RS485Head1头标识符
	TargetAdd	=	Frame->TargetAdd;	          //目标地址
	LayerAddr	=	Frame->Addr.SlotAddr;		    //下一级目标地址：如果下级地址为0，表示此消息是本板使用消息，存入RS485Node[0]  
	FrameLength	=	Frame->DataLength+13;     //整个帧长度
  if((TargetAdd ==  HCSYS.SwitchAddr)     //本板消息
    &&(0  ==  UDflag))                    //此消息为上层下发消息
  {
    if(0  ==  Frame->DataLength)  //无数据，表示为单元板应答
    {
      TransU.Length = 0;      //清除上传标志
      return RES_ACKMSG;      //退出--返回此标志为应答标志
    }
    memcpy(&(DataNode[LayerAddr].data[0]),Frame,FrameLength+13);   //复制数据到本地缓存
    if((0<LayerAddr)&&(0xFF>LayerAddr))   //此消息需要传递到下一层
    {
      ((RS485FrameDef*)(DataNode[LayerAddr].data))->TargetAdd  	= LayerAddr;        //目标地址
      ((RS485FrameDef*)(DataNode[LayerAddr].data))->SourceAdd  	= 0x00; 						//源地址--下发为00
      
      DataNode[LayerAddr].data[Frame->DataLength+11]  = BCC8(DataNode[LayerAddr].data,Frame->DataLength+11);  //重新计数校验
      DataNode[LayerAddr].data[Frame->DataLength+12]  = RS485end1;
      
      DataNode[LayerAddr].FarmeInfo.Length = Frame->DataLength+13;  //整个帧长度
      DataNode[LayerAddr].FarmeInfo.UD     = 1;    //此数据需要转发到下一级
      DataNode[LayerAddr].FarmeInfo.Flag   = 1;    //有数据标识
    }
    res	=	RES_OK;
  }
  else if(1  ==  UDflag)      //底层上传数据：需要添加本层地址后待上传
  {
    if(0  ==  Frame->DataLength)  //无数据，表示为驱动板应答
    {
      TransD.Length = 0;      //清除下发标志
      return RES_ACKMSG;      //退出--返回此标志为应答标志
    }
    memcpy(&(DataNode[LayerAddr].data[0]),Frame,Frame->DataLength+13);      							//复制数据到本地缓存
    ((RS485FrameDef*)(DataNode[LayerAddr].data))->TargetAdd					= 0;    							//目标地址:上传为0
    ((RS485FrameDef*)(DataNode[LayerAddr].data))->SourceAdd					= HCSYS.SwitchAddr;  	//源地址
    
    ((RS485FrameDef*)(DataNode[LayerAddr].data))->Addr.LayerAddr    = HCSYS.SwitchAddr;  	//加入本地址--层板地址
    
    DataNode[LayerAddr].data[Frame->DataLength+11]  = BCC8(DataNode[LayerAddr].data,Frame->DataLength+11);  //重新计数校验
    DataNode[LayerAddr].data[Frame->DataLength+12]  = RS485end1;
    DataNode[LayerAddr].FarmeInfo.Length            = Frame->DataLength+13;  //整个帧长度
    DataNode[LayerAddr].FarmeInfo.UD     = 0;    //此数据需要转发到上一级
    DataNode[LayerAddr].FarmeInfo.Flag   = 1;    //有数据标识
    res	=	RES_OK;
  }
  else
  {
    res	= RES_UNKNOW;
  }
  return res;
}
/*******************************************************************************
* 函数名			:	SALayerDataProcess
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult SALayerDataProcess(const unsigned char *buffer,const unsigned short length,const unsigned char UDflag)
{
	HCResult	res	=	RES_OK;
  RS485FrameDef *Frame  = NULL;
//  unsigned char *Address  = NULL;	//地址域起始地址
	unsigned char TargetAdd	=	0;		//目标地址
//	unsigned char LayerAddr	=	0;		//层地址
  if(NULL ==  buffer)		//空地址
  {
    return RES_NODATA;
  }
	Frame	    =	(RS485FrameDef*)memchr(buffer,RS485Head1,length);		//查找RS485Head1头标识符
	TargetAdd	=	Frame->TargetAdd;	          //目标地址

  if((TargetAdd ==  HCSYS.SwitchAddr)     //本板消息
    &&(0  ==  UDflag))                    //此消息为上层下发消息
  {
    if(0  ==  Frame->DataLength)  //无数据，表示为层板应答
    {
      TransU.Length = 0;      //清除上传标志
      return RES_ACKMSG;      //退出--返回此标志为应答标志
    }
    memcpy(&(DataNode[0].data[0]),Frame,Frame->DataLength+13);   //复制数据到本地缓存
    res	=	RES_OK;
		
		//------------------------------模拟数据上传
//		Frame->SourceAdd	=	HCSYS.SwitchAddr;
//		Frame->TargetAdd	=	0x00;
		memcpy(TransU.data,Frame,Frame->DataLength+13);   //复制数据到本地缓存
		Frame	=	(RS485FrameDef*)TransU.data;
		
		Frame->SourceAdd	=	Frame->TargetAdd;
		Frame->TargetAdd	=	0x00;
		TransU.Length	=	Frame->DataLength+13;
		TransU.Retry.Retry	=	0;
		TransU.Retry.Time		=	0;
  }
  else
  {
    res	= RES_UNKNOW;
  }
  return res;
}
/*******************************************************************************
* 函数名			:	DataCheck
* 功能描述		:	数据校验
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult CheckDataFarm(const unsigned char *buffer,const unsigned short length,const unsigned char UDflag)
{
  HCResult	res	=	RES_OK;
  RS485FrameDef   *RS485Frame	= NULL;
	RS232FrameDef		*RS232Frame	=	NULL;
  unsigned char   Bcc8      = 0;    //校验码
//  unsigned short  BassAddr  = 0;    //找到头标识符在输入数组中的偏移地址
	if(NULL ==  buffer)		//空地址
  {
    return RES_NODATA;
  }
	RS232Frame	=	(RS232FrameDef*)memchr(buffer,RS232Head1,length);		//查找RS485Head1头标识符
	if(NULL	!=	RS232Frame)			//未找到RS232Head1
	{
		if((RS232Head2==RS232Frame->Head.Head2)
			&&(length>=sizeof(RS232HeadDef)))
		{
			return RES_FARME232;     	//232格式数据
		}
	}
	
  RS485Frame	=	(RS485FrameDef*)memchr(buffer,RS485Head1,length);		//查找RS485Head1头标识符
  if(NULL == RS485Frame)         //未找到头标识符
  {
    return RES_FARMERR;     //帧格式错误
  }
  if(MinDataLen>length) 		//数据长度校验(消息长度==Frame->Length+1字节校验位)
  {
    return RES_FARMERR;     //帧格式错误
  }
	if(	(0	==	UDflag)				//上层下发，匹配目的地址
		&&(HCSYS.SwitchAddr	!=	RS485Frame->TargetAdd))	//地址不匹配
	{
		return RES_UNKNOW;
	}
  Bcc8  = BCC8((unsigned char*)RS485Frame,RS485Frame->DataLength+11);      //固定长度为7（从RS485Head到End校验）  
  if(Bcc8 ==  ((unsigned char*)RS485Frame)[RS485Frame->DataLength+11])   	//校验位在消息尾端，不计算在消息长度内
  {
		if(eBoxAck	==	RS485Frame->StsCode)
			return RES_ACKMSG;
		else
			return RES_FARME485;     	//232格式数据
  }  
  return res;
}
/*******************************************************************************
* 函数名			:	DataCheck
* 功能描述		:	数据校验
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult RS485FarmCheck(const unsigned char *buffer,const unsigned short length,const unsigned char UDflag)
{
  HCResult	res	=	RES_OK;
  RS485FrameDef   *RS485Frame	= NULL;
	RS232FrameDef		*RS232Frame	=	NULL;
  unsigned char   Bcc8      = 0;    //校验码
//  unsigned short  BassAddr  = 0;    //找到头标识符在输入数组中的偏移地址
	if(NULL ==  buffer)		//空地址
  {
    return RES_NODATA;
  }
	switch(HCSYS.Layer)
  {
   case MBLayer:      //0-主板(网关板)
								RS232Frame	=	(RS232FrameDef*)memchr(buffer,RS232Head1,length);		//查找RS485Head1头标识符
								if(NULL	==	RS232Frame)	//未找到
								{
									return RES_FARMERR;     //帧格式错误
								}
								if(RS232Frame->Head.Head2	==	0xF5)
								{
								}
     break;
   case CALayer:      //1-单元板
        res = CALayerDataProcess(buffer,length,UDflag);     //单元板数据处理
     break;
   case LALayer:      //2-层板
        res = LALayerDataProcess(buffer,length,UDflag);     //层板数据处理
     break;
   case SALayer:      //3-驱动板
        res = SALayerDataProcess(buffer,length,UDflag);     //驱动板数据处理
     break;
   default:break;
  }
	res	=	AckDataProcess(buffer,length,UDflag);
	
  
	
	
	
	
  RS485Frame	=	(RS485FrameDef*)memchr(buffer,RS485Head1,length);		//查找RS485Head1头标识符
  if(NULL == RS485Frame)         //未找到头标识符
  {
    return RES_FARMERR;     //帧格式错误
  }
  if(MinDataLen>length) 		//数据长度校验(消息长度==Frame->Length+1字节校验位)
  {
    return RES_FARMERR;     //帧格式错误
  }
	if(	(0	==	UDflag)				//上层下发，匹配目的地址
		&&(HCSYS.SwitchAddr	!=	RS485Frame->TargetAdd))	//地址不匹配
	{
		return RES_UNKNOW;
	}
  Bcc8  = BCC8((unsigned char*)RS485Frame,RS485Frame->DataLength+11);      //固定长度为7（从RS485Head到End校验）  
  if(Bcc8 ==  ((unsigned char*)RS485Frame)[RS485Frame->DataLength+11])   	//校验位在消息尾端，不计算在消息长度内
  {
		if(eBoxAck	==	RS485Frame->StsCode)
			return RES_ACKMSG;
		else
			return RES_OK;          //数据校验正确
  }  
  return res;
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: buffer  输入的数据缓存地址
              UDflag  0-获取向上传的数据
                      1-获取向下发数据缓存
* 返回值			: 缓存长度
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
unsigned short GetDataProcess(unsigned char *buffer,const unsigned char UDflag)
{	
	unsigned char i	=	0;
  unsigned short Length = 0;
  //=================================获取待上传数据
  if(0  ==  UDflag)
  {
    Length  = TransU.Length;
    if(Length)                  //发送缓冲有数据
    {
      memcpy(buffer,TransU.data,Length);
			if(TransU.Retry.Retry++>=ReSendCount)
			{
				TransU.Length	=	0;
			}
      return Length;
    }
    else                        							//发送缓冲区无数据，检查数据队列中有没待发送数据
    {
			Length	=	0;
      for(i	=	1;i<=MaxNetPerLayer;i++) 				//遍历
      {				
        if((1	==	DataNode[i].FarmeInfo.Flag)&&(0 ==  DataNode[i].FarmeInfo.UD))
        {
					Length  = DataNode[i].FarmeInfo.Length;
					
					memcpy(TransU.data,DataNode[i].data,Length);
					memcpy(buffer,DataNode[i].data,Length);
					
					TransU.Length               = 	Length;
					TransU.Retry.Retry          = 	0;
					TransU.Retry.Time           = 	0;
          DataNode[i].FarmeInfo.Flag  =	0;  //清除待发送标志
					return Length;
        }
      }
      return Length;
    }
  }
  //=================================获取待下发数据
  else
  {
    Length  = TransD.Length;
    if(Length)                  //发送缓冲有数据
    {
      memcpy(buffer,TransD.data,Length);
			if(TransD.Retry.Retry++>ReSendCount)		//下发示响应
			{				
				TransD.Length	=	0;
			}
      return Length;
    }
    else                        //发送缓冲区无数据，检查数据队列中有没待发送数据
    {
			Length	=	0;
      for(i	=	1;i<=MaxNetPerLayer;i++) //遍历
      {				
        if((1	==	DataNode[i].FarmeInfo.Flag)&&(1 ==  DataNode[i].FarmeInfo.UD))
        {
					Length  = DataNode[i].FarmeInfo.Length;
					
					memcpy(TransD.data,DataNode[i].data,Length);
					memcpy(buffer,DataNode[i].data,Length);
					
					TransD.Length             	=	Length;
					TransD.Retry.Retry        	=	0;
					TransD.Retry.Time         	=	0;
					DataNode[i].FarmeInfo.Flag	=	0;  //清除待发送标志
					return Length;
        }
      }
      return Length;
    }
  }
//	return Length;
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult UMFrameProcess(const unsigned char *buffer)
{
	HCResult	res	=	RES_OK;

	//=====================================转发上层数据

	//=====================================转发下级数据
	return res;
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult DMFrameProcess(const unsigned char *buffer)
{
	HCResult	res	=	RES_OK;

	//=====================================转发上层数据

	//=====================================转发下级数据
	return res;
}














